{
  "dataTown": [
    {
      "id": 1,
      "name": "Valle de Bravo",
      "state": "Estado de México",
      "infoState": "A tan sólo 145 km. de la Ciudad de México se encuentra Valle de Bravo, uno de los lugares favoritos de los habitantes de la capital y Toluca; centro de relajación y de descanso de turistas de todo el mundo. Su nombre se debe al general Nicolás Bravo, quien fue el hombre de confianza de José María Morelos y presidente interino o sucesor en México en tres ocasiones. El clima que acompaña a Valle de Bravo es excelente casi todo el año, el sol calienta sus calles y se acompaña de una brisa fresca al estar cerca del lago y es ideal para disfrutar de un paseo en lancha o una caminata por sus calles, llenas de tiendas artesanales y restaurantes con cocina tradicional e internacional.",
      "img": "https://media.architecturaldigest.com/photos/5bd0e1fc54bd2b5be7ac78cb/16:9/w_2560%2Cc_limit/GettyImages-162318248.jpg",
      "pts": "4.5",
      "attractions": [
        {
          "name": "Cascadas Velo de Novia",
          "info": "Sigue el sonido del agua que hace eco en una región de vegetación frondosa para llegar a la cascada Velo de Novia. Relaja tu mente mientras contemplas el bello paisaje de este lugar. La cascada Velo de Novia mide 35 metros (115 ft) de altura y su nombre se debe a que se parece a ese famoso artículo nupcial. La cascada está ubicada en una reserva natural y su agua fluye hacia el lago Avándaro, que está en los alrededores.",
          "img": "https://www.sinpostal.com/wp-content/uploads/2019/03/Chiflon_SinPostal-8.jpg",
          "cost": "$85",
          "distance": "10 kilómetros (6 mi) al suroeste",
          "type": "Cascadas"
        },
        {
          "name": "Santuario Piedra Herrada",
          "info": "Piedra Herrada es uno de los tres santuarios de la Reserva de la Biosfera de la Mariposa Monarca que se localizan en el Estado de México. Es un ejido ubicado entre Temascaltepec y Valle de Bravo, en el que según los visitantes pueden vivir la experiencia más espiritual que la naturaleza llega a ofrecer.",
          "img": "https://www.eluniversal.com.mx/sites/default/files/N-A21-EU011219-1_DrupalMainImagennuevo.var_1575188653.jpg",
          "cost": "$90",
          "distance": "28 kilómetros",
          "type": "Santuario"
        }
      ]
    },
    {
      "id": 2,
      "name": "Villa del Carbón",
      "state": "Estado de México",
      "infoState": "Villa de Carbón es un rinconcito del Estado de México rodeado de bosque y contrucciones coloniales. Se llamaba Nñontle, que significa “Cima del Cerro”, y fue un poblado otomí, aunque posteriormente dominados por los aztecas. En tiempos de la colonia, el poblado cambió de nombre por Nuestra Señora de la Peña de Francia, y después se le llamó Villa del Carbón. La principal actividad era la extracción del carbón, por ello su nombre, pero ahora es el turismo y actividades comerciales. Desde el 2015 es considerado un Pueblo Mágico, pues cuenta con mucha cultura, tradiciones y varias atracciones.",
      "img": "https://www.elsiglodetorreon.com.mx/m/i/2019/01/1136541.jpeg",
      "pts": "3.8",
      "attractions": [
        {
          "name": "Mercado de artesanías",
          "info": "Visita el mercado de artesanías, la población de este pueblo del Estado de México tiene mucha experiencia y creatividad para diseñar artesanías. En el mercado venden artículos de piel fabricados a mano, como bolsas, chamarras, botas, cinturones, guantes y más. El artículo que más sobre sale es el botín charro, en Villa del Carbón hay muchísimos talleres que producen este calzado. Otro material que los artesanos trabajan mucho es la lana, realizan prendas de ropa como bufandas, playeras y chamarras, así como cobijas, guantes y calcetines. ¡Lleva un obsequio a las personas que no pudieron acompañarte en este viaje y apoya a los artesanos locales!",
          "img": "https://rinconesdemexico.com/wp-content/uploads/shutterstock_1433784392-1.jpg",
          "cost": "$230",
          "distance": "12 km",
          "type": "Mercado"
        },
        {
          "name": "Las presas",
          "info": "En Villa del Carbón hay varias presas, las que te recomendamos son Presa del Llano y Presa Taxhimay. La Presa Llano es hermosa, está rodeada de árboles altos y frondoso. Ahí puedes hacer actividades al aire libre como senderismo, hacer un paseo en lancha, pescar e incluso pasar una noche acampando o rentando una de las acogedoras cabañas. En la Presa Taxhimay encontrarás muchas especies animales dignas de estudiar y también están las ruinas del pueblo de San Luis de las Peras, un antiguo poblado que se tuvo que deshabitar cuando decidieron construir la presa.",
          "img": "https://rinconesdemexico.com/wp-content/uploads/shutterstock_1433754023-1.jpg",
          "cost": "$65",
          "distance": "20km",
          "type": "Presas"
        }
      ]
    },
    {
      "id": 3,
      "name": "Mineral del Chico",
      "state": "Hidalgo",
      "infoState": "En esta región se han practicado desde hace décadas actividades deportivas y recreativas; actualmente se considera la meca del turismo de naturaleza y aventura. En sus montañas, valles y presas se practica ciclismo de montaña, pesca deportiva, senderismo, campamentos, descenso a rappel, tirolesas y especialmente la escalada en roca, ya que en el Parque Nacional El Chico existen más de 200 formaciones rocosas con sitios maravillosos para este deporte. Es un verdadero paraíso natural en medio del bosque.",
      "img": "https://www.mineraldelchico.com.mx/wp-content/uploads/2015/09/LasVentanas15-930x523.jpg",
      "pts": "3.8",
      "attractions": [
        {
          "name": "Parque Nacional El Chico",
          "info": "Este parque es uno de los más antiguos que hay en México, pues su fundación a saber data desde el periodo que se conoce como el Porfiriato, donde hacia el año de 1898 el entonces presidente de le república, el General Porfirio Díaz por decreto indica la protección de esta área bajo el nombre de Monte Vedado del Mineral del Chico, un grande bosque de coníferas, con un ecosistema diverso que observar y sobretodo cuidar, numerosas formaciones rocosas de siluetas caprichosas, incluyendo también pequeños valles, lagunas y ríos de aguas cristalinas. Es muy visitado ya que cuenta con instalaciones donde se pueden practicar deportes como la escalada, senderismo, campismo (por mencionar algunos) o simplemente la contemplación de sus bellos paisajes. Si eres un aventurero o un amante de la naturaleza este parque es para ti. Partiendo de aquí también abordaremos otros puntos de interés dentro del mismo parque.",
          "img": "https://mxcity.mx/wp-content/uploads/2020/09/mineral.jpg",
          "cost": "$160",
          "distance": "8 km",
          "type": "Parque"
        },
        {
          "name": "Mirador Peña del Cuervo",
          "info": "La Peña del Cuervo es un mirador natural localizado en la cima de una de las montañas que rodean al poblado de Mineral del Chico; se ubica dentro del Parque Nacional El Chico, a una altitud de 2,770 msnm, desde cuya base es posible contemplar una de las mejores y más completas vistas panorámicas del parque. Su cima, a la cual es posible acceder por una escalinata de piedra de fácil ascenso, se compone de una plancha circular de concreto bordeada de un barandal de alambre; desde esta plataforma es posible apreciar hermosas vistas tanto del pueblo mágico de Mineral del Chico, como de diversas formaciones rocosas existentes en el parque natural, entre ellas las conocidas como “Las Monjas”, que destacan por sus caprichosas formas e imponente tamaño; también se puede observar a la lejanía, las rocas conocidas como “Los Frailes”, pertenecientes al Municipio de El Arenal, en el Valle del Mezquital. Ideal para tomarse fotos y descubrir lo bella que es la vida.",
          "img": "https://www.mexicodesconocido.com.mx/wp-content/uploads/2020/03/90632545_860188647720232_2274228858754433024_o.jpg",
          "cost": "$230",
          "distance": "12 km",
          "type": "Mirador"
        }
      ]
    },
    {
      "id": 4,
      "name": "Ixtapan de la sal",
      "state": "Estado de México",
      "infoState": "Este Pueblo Mágico es sinónimo de descanso y salud, un lugar para meditación, curación y sobre todo de relajación gracias a sus excelentes servicios de masaje y fisioterapia. Ofrece un magnífico clima soleado, sus célebres aguas termales de propiedades curativas, y una vegetación exuberante; vive la usanza de un baño de vapor prehispánico: el temazcal. Déjate guiar por los cantos de un chamán, medita y encuéntrate con lo más profundo de tu ser y del universo.",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/PlazaChurchIxtapan.JPG/275px-PlazaChurchIxtapan.JPG",
      "pts": "3.9",
      "attractions": [
        {
          "name": "Parque Acuático Ixtapan de la Sal",
          "info": "Este es uno de los atractivos más famosos de Ixtapan de la Sal ya que sus albercas con aguas termales y de olas, así como los paseos en lancha, toboganes y las atracciones infantiles hacen de este un lugar perfecto para pasar un día en familia.",
          "img": "https://imgcy.trivago.com/c_limit,d_dummy.jpeg,f_auto,h_1300,q_auto,w_2000/itemimages/79/57/795751.jpeg",
          "cost": "$85",
          "distance": "12 km",
          "type": "Parque Acuatico"
        },
        {
          "name": "Grutas la Estrella",
          "info": "Si usted desea realizar un inolvidable paseo familiar, a sólo 10 km de Tonatico se localizan las Grutas de la Estrella, en cuyo interior se pueden admirar las diversas formas naturales, de las estalactitas, estalagmitas. Las Grutas de la Estrella una maravilla de la naturaleza, han sido producidas por el escurrimiento del agua a través de las fisuras de la roca, depositando sales minerales y bicarbonato de calcio, que han permitido crear figuras bautizadas por los lugareños como el Mamut, los Novios, la Mano, el Palacio, el Águila, los Candiles, la Cruz, el Perfil de Cante y el Pórtico.",
          "img": "https://www.gob.mx/cms/uploads/article/main_image/7782/GrutasDeLaEstrella_0000_Grutas02.jpg",
          "cost": "$178",
          "distance": "20 km",
          "type": "Grutas"
        }
      ]
    },
    {
      "id": 5,
      "name": "Real del Monte",
      "state": "Hidalgo",
      "infoState": "Ubicado a quince minutos de la capital de Hidalgo es el lugar habitado más alto del país. Esta región, históricamente minera fue testigo de importantes episodios como la primera huelga de América, o el nacimiento de la pasión por el futbol soccer en México, cuando los mineros ingleses lo introdujeron al país. Aquí se disputó el primer partido de futbol del país, deporte que llegó para quedarse. Actualmente Real del Monte es uno de los emblemas turísticos de Hidalgo y forma parte de la ruta Corredor de la Montaña que agrupa a poblaciones como Huasca de Ocampo, Mineral del Chico, Omitlán o Atotonilco.",
      "img": "https://lasillarotarm.blob.core.windows.net/images/2019/12/27/realdelmonte-focus-0-0-696-394.jpg",
      "pts": "4.7",
      "attractions": [
        {
          "name": "Centro Historico de Mineral del Monte",
          "info": "Con mucha historia que compartir, las calles empedradas de este pueblo son muy agradables para caminar aunque cansadas ya que suben y bajan. Entre lo que debes ver está la Parroquia de Nuestra Señora del Rosario, el Santuario del Señor de Zelontla, las impresionantes casonas de estilo inglés, así como el kiosco y fuente del jardín principal. Por supuesto que cada pocos pasos tendrás comercios que te ofrecen pastes y varios talleres de plata.",
          "img": "https://www.zonaturistica.com/files/atractivos/1103/A1_1103.jpg",
          "cost": "$60",
          "distance": "0 km",
          "type": "Centro Histórico"
        },
        {
          "name": "Bosque de las Truchas",
          "info": "El Bosque de las Truchas es un espacio encantado y ubicado dentro de San Miguel Regla, en el Pueblo Mágico de Real del Monte, un lugar ecoturístico y en el que se puede hallar un centro piscícola que cuenta con lagos, manantiales y senderos que ayudarán al visitante a pasar un fin de semana en familia comiendo una variedad de platillos a base de truchas, o una rica nieve mientras se disfruta del escenario natural rodeado de hermosos árboles, pinos y abedules.",
          "img": "https://i1.wp.com/pachucabrilla.com/wp-content/uploads/2019/07/1A4B977B-3BA4-4888-9DD4-85661ACF2477.jpeg?fit=600%2C449&ssl=1",
          "cost": "$150",
          "distance": "4.3km",
          "type": "Centro Ecoturistico"
        }
      ]
    },
    {
      "id": 6,
      "name": "Tepotzotlán",
      "state": "Estado de México",
      "infoState": "Tepotzotlán es una localidad y cabecera municipal del municipio homónimo en el Estado de México. El municipio forma parte de la zona metropolitana del Valle de México. Localizado a 43.5 km al noroeste del centro de la Ciudad de México. Su principal atractivo turístico es el Museo Nacional del Virreinato, el cual utiliza como infraestructura lo que fue el Colegio Jesuita de San Martín y San Francisco Javier, cabe mencionar que este edificio fue construido entre los siglos XVII y XVIII, exclusivamente por los miembros de la Compañía de Jesús, así como el templo de San Pedro Apóstol. Además, está catalogado como Pueblo mágico de México.",
      "img": "https://www.gob.mx/cms/uploads/article/main_image/84226/Acueducto-de-Tepotzotlan-Edo-Mex-web.jpg",
      "pts": "3.8",
      "attractions": [
        {
          "name": "Museo Nacional del Virreinato",
          "info": "El inmueble que hoy alberga al Museo Nacional del Virreinato fue el lugar donde se instauraron tres colegios para los niños indígenas y para los jesuitas.  También, se debe mencionar que a pesar que este inmueble fue abandonado durante mucho tiempo después de que los jesuitas fueran expulsados y sufrió deterioro, si se pudo salvar de la destrucción total y, por lo tanto, actualmente se puede apreciar las cualidades artísticas, estéticas y particulares que hicieron del colegio jesuita el sitio idóneo para albergar un museo nacional que resguardara la historia virreinal de México.  En consecuencia, surgió una política gubernamental orientada a mostrar en diferentes recintos la historia de México en sus distintas etapas, y fue así que se inició la restauración de este edificio para que albergara el Museo Nacional del Virreinato donde se exhiben numerosas piezas de valor artístico e histórico de la época virreinal en México, tales como, pintura, escultura, platería, cerámica, porcelana, etc.",
          "img": "https://viajares.es/wp-content/uploads/2019/06/mexico-museo-nacional-virreinato-teopotzolan.jpg",
          "cost": "$56",
          "distance": "12 km",
          "type": "Museo"
        },
        {
          "name": "Arcos del Sitio",
          "info": "El acueducto de Tepotzotlán, conocido también como arcos de Xalpa o arcos del sitio, es una monumental obra levantada en la época virreinal a principios del siglo XVIII, por la comunidad jesuita que se ubicaba en el cercano Colegio de San Francisco Xavier (hoy Museo Nacional del Virreinato), en el poblado de Tepotzotlán, Estado de México. La obra llevaba el agua desde la sierra de Tepotzotlán hasta la hacienda de Xalpa. Debido a la expulsión de la orden a finales del mismo siglo, la obra quedó inconclusa, pero se retomaron los trabajos a mediados del siglo XIX. Durante su trayecto, atraviesa una cañada, en donde alcanza una profundidad de 62 metros de altura y levantan la obra cuatro niveles de arcos. La longitud total de esta obra es de 430 metros. Actualmente en la zona se estableció un parque eco turístico, que ofrece algunas actividades recreativas. Su estilo arquitectónico es Barroco.",
          "img": "https://d3tf9yuhsp2bpn.cloudfront.net/images/2020/10/05/20201005-1601941098-Excursio%CC%81n-a-los-Arcos-del-Sitio-tu-experiencia-II.jpg",
          "cost": "$135",
          "distance": "32 km",
          "type": "Parque Ecologico"
        }
      ]
    },
    {
      "id": 7,
      "name": "Huasca de Ocampo",
      "state": "Hidalgo",
      "infoState": "Primer Pueblo Mágico de México, destacado por sus increíbles paisajes naturales, lugares históricos, hermosas vistas, calles empedradas, paseos románticos, haciendas coloniales, lugares mágicos, donde se combinan lo hecho por el hombre y la obra de la naturaleza, creando una imagen agradable y acogedora para pasar unos días de verdadero descanso en esta pintoresca provincia. Pintoresco, sencillo y sobre todo estratégico, Huasca es un punto de partida perfecto para explorar las ex haciendas de beneficio, los bosques de oyamel, las presas, las formaciones rocosas y una joya natural que sobresale entre las otras: los Prismas Basálticos. Huasca de Ocampo ha atraído con su magia a personalidades como Humboldt, Melchor Ocampo y Romero de Terreros.",
      "img": "http://www.pueblosmexico.com.mx/IMG/arton173.jpg",
      "pts": "4.1",
      "attractions": [
        {
          "name": "Reserva de Biósfera de la Barranca de Metztitlán",
          "info": "La Reserva de la Biosfera Barranca de Metztitlán es una de las Áreas Protegidas de carácter federal más grandes del estado de Hidalgo, se decretó como tal el 27 de noviembre del año 2000. Forma parte del Corredor Biológico de las zonas áridas del Altiplano Mexicano Central de país. La Reserva cubre una extensión de 96,042.94 hectáreas, de las cuales 12,474.13 corresponden a las zonas núcleo y 83,568.81 a la zona de amortiguamiento; comprende el 4.6% de la superficie estatal e incluye parte de los municipios de Acatlán, Atotonilco el Grande, Eloxochitlán, Huasca de Ocampo, Metepec, Metztitlán, San Agustín Metzquititlán y Zacualtipán.",
          "img": "https://pbs.twimg.com/ext_tw_video_thumb/938181134000590848/pu/img/ej4y0bG1SH-gXmMN.jpg",
          "cost": "$45",
          "distance": "42 km",
          "type": "Reserva Biosfera"
        },
        {
          "name": "Barranca de Aguacatitla",
          "info": "Este es un pedacito hidalguense de la Reserva de la Biosfera de Metztitlán, donde se puede observar la continuación del sistema de prismas basálticos que han dado fama turística a Huasca de Ocampo, ubicado a escasos 30 minutos. Aquí se viaja para apreciar tres tipos de bosque: de encinos, de matorrales y tropical. Esto beneficia el área y ofrece a los visitantes, la oportunidad de realizar diversas actividades dentro de la barranca. La más popular es el circuito de canopy, conformado por seis tirolesas. Para llegar a las plataformas, hay que caminar por huertos de duraznos y naranjas.",
          "img": "https://tipsparatuviaje.com/wp-content/uploads/2016/07/3.-Barranca-de-Aguacatitla.jpg",
          "cost": "$85",
          "distance": "12 km",
          "type": "Barrancas"
        }
      ]
    }
  ],
  "comments": [
    {
      "id": 1,
      "name": "Antonio Moreno",
      "body": "Asombroso Lugar",
      "pts": "4.4",
      "dataTownId": 1,
      "userId": 1
    },
    {
      "id": 2,
      "name": "Paulina Mendez",
      "body": "Excelente lugar para ir con la familia",
      "pts": "4.2",
      "dataTownId": 2,
      "userId": 2
    }
  ],
  "users": [
    {
      "id": 1,
      "name": "Antonio Moreno",
      "username": "amoreno",
      "email": "amoreno@gmail.com",
      "password": "912033a2c4747781b64c36a366218707",
      "isLogged": false
    },
    {
      "id": 2,
      "name": "Paulina Mendez",
      "username": "pmendez",
      "email": "pmendez@gmail.com",
      "password": "78838048c0a04badfec6f3f8f32a90b7",
      "isLogged": false
    },
    {
      "id": 3,
      "name": "Joaquin",
      "username": "joaquin",
      "email": "joaquin@gmail.com",
      "password": "2b80773074c7c7a48b3a9b0aaeac4837",
      "isLogged": false
    },
    {
      "id": 4,
      "name": "Rodrigo Gomez",
      "username": "rodrigo",
      "email": "rodri@gmail.com",
      "password": "bd3711d0dd00de22e9d2fb6c1bdd85d6",
      "isLogged": false
    },
    {
      "id": 5,
      "name": "Juana Lopez",
      "username": "juanita",
      "email": "juanita@gmail.com",
      "password": "d44c84f29768fdc6bc18fdb77e00849e",
      "isLogged": false
    },
    {
      "id": 6,
      "name": "Liz Lucas",
      "username": "lizlucas",
      "email": "liz@gmail.com",
      "password": "b1c349de61e5ba64a64cd71e22638b07",
      "isLogged": false
    },
    {
      "id": 7,
      "name": "Paulina",
      "username": "paumucito",
      "email": "paulina.mucito@gmail.com",
      "password": "78838048c0a04badfec6f3f8f32a90b7",
      "isLogged": false
    },
    {
      "id": 8,
      "name": "And",
      "username": "r",
      "email": "contreras9996@gmail.com",
      "password": "1dc90e80c77fe245a82ea7ed30d1f849",
      "isLogged": false
    },
    {
      "id": 9,
      "name": "wdf",
      "username": "fh",
      "email": "fdff@d.com",
      "password": "d8cb27dfc24bfc0cf3f18e43149b5d1a",
      "isLogged": false
    },
    {
      "id": 10,
      "name": "antonio martinez",
      "username": "antoniom",
      "email": "antonio@yahoo.com",
      "password": "912033a2c4747781b64c36a366218707",
      "isLogged": false
    },
    {
      "id": 11,
      "name": "estefania najera",
      "username": "estefania",
      "email": "estefa@gmail.com",
      "password": "e72780e104a21a2d1b331a311e87f329",
      "isLogged": false
    },
    {
      "id": 12,
      "name": "roberto guerrero",
      "username": "robertogh",
      "email": "robert@yahoo.com",
      "password": "eef1277974665419df56cb3aab4d894a",
      "isLogged": false
    },
    {
      "id": 13,
      "name": "Raquel Vazquez",
      "username": "raquel",
      "email": "raquel@gmail.com",
      "password": "7c324d6ebfcd6718de98c51b05620607",
      "isLogged": false
    }
  ]
}